# Import Packages
Below, you'll find what you need in order to run this notebook successfully. I used Pandas and Matplotlib.

In [ ]:
import matplotlib.pyplot as plt
import pandas as pd

# Read Data In
I pulled in baby name data from 2010 and 2019; the show premiered in April 2011, so I chose the year before as a comparison to demonstrate that some of the names might not have ever been
on anyone's radar, save people that had read the books. I chose 2019 because the series ended in May of that year, so by then, the names would have become a part of pop culture.

In [298]:
#2010 data
df_2010 = pd.read_csv('assets/yob_2010.csv')
#2019 data
df_2019 = pd.read_csv('assets/yob2019.csv')

# Combine the Two Dataframes and Clean Up
I combined the 2010 and 2019 data into one frame so I could clean up and analyze it more easily.

In [299]:

#I combined the two dataframes into one and ignored the restarting of the index number column.
years_dataframes = [df_2010, df_2019]
df_combined_years = pd.concat(years_dataframes, ignore_index=True)

#I know there are Emmas(and other duplicate names) in 2010 and 2019, so how do combine all mentions of Emma (and other names) as one result in the name column? Or do it do it below?

#change NaN values to zeroes
df_combined_years['2010 Name Count'].fillna(0, inplace = True)
df_combined_years['2019 Name Count'].fillna(0, inplace = True)
df_combined_years

           Name Gender  2010 Name Count  2019 Name Count
0      Isabella      F          22925.0              0.0
1        Sophia      F          20648.0              0.0
2          Emma      F          17354.0              0.0
3        Olivia      F          17030.0              0.0
4           Ava      F          15436.0              0.0
...         ...    ...              ...              ...
66156    Zyheem      M              0.0              5.0
66157     Zykel      M              0.0              5.0
66158    Zyking      M              0.0              5.0
66159       Zyn      M              0.0              5.0
66160     Zyran      M              0.0              5.0

[66161 rows x 4 columns]

# Analyze the Data
First, I used the .loc method to retrieve rows from the dataframe that contained specific _Game of Thrones_ character names.

In [304]:
#See how many times specific character names show up in the dataframe to compare occurences in year 2010 vs. 2019
df_combined_years.loc[(df_combined_years['Name']=='Cersei') |  
                        (df_combined_years['Name']=='Arya') | 
                        (df_combined_years['Name']=='Jon') | 
                        (df_combined_years['Name']=='Khaleesi') |
                        (df_combined_years['Name']=='Catelyn') |
                        (df_combined_years['Name']=='Bran') |
                        (df_combined_years['Name']=='Brienne') |
                        (df_combined_years['Name']=='Daenerys') |
                        (df_combined_years['Name']=='Jaime') |
                        (df_combined_years['Name']=='Joffrey') |
                        (df_combined_years['Name']=='Jorah') |
                        (df_combined_years['Name']=='Margaery') |
                        (df_combined_years['Name']=='Melisandre') |
                        (df_combined_years['Name']=='Robb') |
                        (df_combined_years['Name']=='Samwell') |
                        (df_combined_years['Name']=='Sansa') |
                        (df_combined_years['Name']=='Theon') |
                        (df_combined_years['Name']=='Tyrion')
                         ]

           Name Gender  2010 Name Count  2019 Name Count
941        Arya      F            273.0              0.0
2123    Catelyn      F             93.0              0.0
2263      Jaime      F             85.0              0.0
6419    Brienne      F             20.0              0.0
20185     Jaime      M            814.0              0.0
20398       Jon      M            439.0              0.0
21548      Arya      M             88.0              0.0
27369    Tyrion      M             11.0              0.0
32301      Bran      M              5.0              0.0
34179      Arya      F              0.0           3047.0
34670  Khaleesi      F              0.0            522.0
35607  Daenerys      F              0.0            142.0
37379     Jaime      F              0.0             48.0
38346   Brienne      F              0.0             33.0
38955     Sansa      F              0.0             28.0
41495   Catelyn      F              0.0             15.0
47112     Jorah      F              0.0              7.0
48217    Cersei      F              0.0              6.0
51157  Margaery      F              0.0              5.0
52601     Jaime      M              0.0            518.0
52815       Jon      M              0.0            315.0
54447    Tyrion      M              0.0             57.0
54686      Arya      M              0.0             49.0
55350     Jorah      M              0.0             35.0
56040     Theon      M              0.0             27.0
60144   Samwell      M              0.0             10.0
61049      Bran      M              0.0              8.0
64580  Daenerys      M              0.0              5.0

In [314]:
#How do I put, for example, all female instances of "Arya" in one row?